app/controllers/rooms_controller.rb

SELECT `rooms`.* FROM `rooms`
---
  def index
    @rooms = Room.all

INSERT INTO `rooms` (`title`, `created_at`, `updated_at`) VALUES ('First room', '2016-08-04 07:01:17', '2016-08-04 07:01:17')
---
  def create
    @room = Room.new(room_params)
    respond_to do |format|
      if @room.save

DELETE FROM `rooms` WHERE `rooms`.`id` = 1
---
  def destroy
    @room.destroy

SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
---
    def set_room
      @room = Room.find(params[:id])